Repository: IslamWahied/DriveDoctor
Catalog: lib/l10n/app_*.arb
Languages: ar

# lang
source: Language
ar: اللغة

# firstWelcomeText
source: Join a community of creators
ar: انضم إلى مجتمع من المبدعين

# secondWelcomeText
source: A simple, fun, and creative way to tracking and managing your car's maintenance
ar: طريقة بسيطة لتتبع وإدارة صيانة السيارة الخاص بك

source: Sign Up
ar: انشاء حساب جديد

source: Sign Out
ar: تسجيل الخروج

# deleteAccount
source: Delete My Account
ar: حذف الحساب

source: Sign In
ar: تسجيل الدخول

# loginWelcomeText
source: Welcome Back
ar: مرحبًا بعودتك

# homeWelcomeText
source: Welcome ,
ar: مرحبًا ,

source: Profile
ar: حسابي

# emailErrorMessage
source: Please enter a username/email
ar: الرجاء إدخال اسم المستخدم/البريد الإلكتروني

# emailHint
source: UserName / Email
ar: اسم المستخدم / البريد الإلكتروني

# fullNameErrorMessage
source: Please enter a full name
ar: الرجاء إدخال الاسم الكامل

# fullNameHint
source: Full name
ar: الاسم الكامل

# confirmPasswordErrorMessage
source: Please enter a Confirm Password
ar: الرجاء إدخال تأكيد كلمة المرور

# confirmPasswordHint
source: Confirm Password
ar: تأكيد كلمة المرور

# confirmNotMatchErrorMessage
source: Password and Confirm Password do not match
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقين

# secondEmailErrorMessage
source: Please enter a Second email
ar: الرجاء إدخال البريد الإلكتروني الثاني

# secondEmailHint
source: Second email
ar: البريد الإلكتروني الثاني

# passwordErrorMessage
source: Please enter a password
ar: الرجاء إدخال كلمة المرور

# passwordHint
source: Password
ar: كلمة المرور

# anotherAccountText
source: Or sign up with another
ar: أو قم بالتسجيل

# accountText
source: account.
ar: بحساب اخر.

# orText
source: OR
ar: أو

# logByGoogle
source: CONNECT WITH GOOGLE
ar: التسجيل باستخدام Google

# addCarTitle
source: Add Your First Car
ar: أضف سيارتك الأولى

# currentCars
source: Your current cars
ar: سياراتك الحالية

source: Add Car
ar: إضافة سيارة

# brandNameHint
source: Select Brand Name
ar: اختر اسم العلامة التجارية

# brandNameErrorMessage
source: Please select a car brand
ar: يرجى اختيار علامة تجارية للسيارة

# carModelHint
source: Car Model
ar: طراز السيارة

# carModelErrorMessage
source: Please enter a car model
ar: يرجى إدخال طراز السيارة

# selectLicenseFrom
source: Select License From Date
ar: حدد تاريخ الرخصة من

source: From
ar: من

source: select license from date
ar: حدد تاريخ بدء الرخصة

# selectLicenseTo
source: Select License To Date
ar: حدد تاريخ الرخصة حتى

source: To
ar: حتى

source: select license to date
ar: حدد تاريخ انتهاء الرخصة

source: License From Date
ar: تاريخ بدء الرخصة

# licenseFromDateErrorMessage
source: Please enter a license from date
ar: يرجى إدخال تاريخ بدء الرخصة

source: License To Date
ar: تاريخ انتهاء الرخصة

# licenseToDateErrorMessage
source: Please enter a license to date
ar: يرجى إدخال تاريخ انتهاء الرخصة

source: Kilometers
ar: الكيلومترات

# kilometersErrorMessage
source: Please select a car kilometers
ar: يرجى تحديد عدد الكيلومترات للسيارة

source: License Expiration
ar: انتهاء الرخصة

source: License
ar: الرخصة

source: km
ar: كم

source: Expired
ar: منتهي الصلاحية

source: Details
ar: تفاصيل

source: Old Kilometers
ar: الكيلومترات القديمة

source: New Kilometers
ar: الكيلومترات الجديدة

# pleaseEnterNumber
source: Please enter a number
ar: برجاء إدخال الرقم

# valueMustGreaterFirstField
source: Value must be greater than the first field
ar: يجب أن تكون القيمة أكبر من الحقل الأول

# valueMustGreaterThanZero
source: Value must be greater than 0
ar: يجب أن تكون القيمة أكبر من 0

source: km Over
ar: كم زائد

source: km left
ar: كم المتبقي

source: Model
ar: طراز

source: Days
ar: يوما

source: Add Maintenance
ar: إضافة صيانة

source: Maintenance Name
ar: اسم الصيانة

# maintenanceErrorMessage
source: Please enter Maintenance name
ar: يرجى إدخال اسم الصيانة

source: Maintenance Kilometers
ar: كيلومترات الصيانة

# maintenanceKilometersErrorMessage
source: Please enter Maintenance kilometers
ar: يرجى إدخال كيلومترات الصيانة

source: Last Maintenance Kilometers
ar: آخر كيلومتر للصيانة

# lastMaintenanceKilometersErrorMessage
source: Please enter last Maintenance kilometers
ar: يرجى إدخال آخر كيلومتر للصيانة

# shouldSmallerEqualMaintenanceKilometers
source: should be smaller than or equal to Maintenance kilometers
ar: يجب أن يكون أصغر من أو يساوي كيلومترات الصيانة

# valueSmallerEqualCarKm
source: Value must be smaller Or equal car km
ar: يجب أن تكون القيمة أصغر أو تساوي كيلومتر السيارة

source: Total Cost
ar: التكلفة الإجمالية

source: Date
ar: التاريخ

source: Cost
ar: التكلفة

source: History
ar: السجل

# serviceRepairEvery
source: Service should repair every
ar: يجب إصلاح الخدمة كل

source: Car Kilometers
ar: الكيلومترات للسيارة

source: Last Repair
ar: آخر إصلاح

# enterDetailErrorMessage
source: Please enter a detail
ar: يرجى إدخال التفاصيل

# valueSmallerEqualCarKm0
source: Value must be smaller Or equal car km than 0
ar: يجب أن يكون القيمة أقل أو تساوي كيلومتر السيارة من 0

source: Last Repair Kilometers
ar: كيلومترات آخر إصلاح

source: New Repair Kilometers
ar: كيلومترات إصلاح جديدة

# costErrorMessage
source: Please enter a cost
ar: يرجى إدخال التكلفة

source: Close
ar: إغلاق

source: Submit
ar: حفظ

source: Confirmation
ar: تأكيد

# confirmationMessage
source: Are you sure you want to
ar: هل أنت متأكد أنك تريد

# deleteAccountMessage
source: Delete your account
ar: حذف حسابك
